#### `terraform plan` Success
<details><summary>Show Output</summary>

```

An execution plan has been generated and is shown below.
Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # module.infrastructure.module.kubernetes_cluster_infrastructure.digitalocean_database_cluster.language_service_cache will be created
  + resource "digitalocean_database_cluster" "language_service_cache" {
      + database     = (known after apply)
      + engine       = "redis"
      + host         = (known after apply)
      + id           = (known after apply)
      + name         = "foreign-language-reader-cache"
      + node_count   = 1
      + password     = (sensitive value)
      + port         = (known after apply)
      + private_host = (known after apply)
      + private_uri  = (sensitive value)
      + region       = "sfo2"
      + size         = "db-s-1vcpu-1gb"
      + uri          = (sensitive value)
      + urn          = (known after apply)
      + user         = (known after apply)
      + version      = "5"
    }

  # module.infrastructure.module.kubernetes_cluster_infrastructure.digitalocean_database_db.language_service_cache will be created
  + resource "digitalocean_database_db" "language_service_cache" {
      + cluster_id = (known after apply)
      + id         = (known after apply)
      + name       = "language-service"
    }

  # module.infrastructure.module.kubernetes_cluster_infrastructure.digitalocean_database_firewall.allow_kubernetes_to_redis will be created
  + resource "digitalocean_database_firewall" "allow_kubernetes_to_redis" {
      + cluster_id = (known after apply)
      + id         = (known after apply)

      + rule {
          + created_at = (known after apply)
          + type       = "k8s"
          + uuid       = (known after apply)
          + value      = "8a21a49b-10ef-4e85-8785-bd9f6e433842"
        }
    }

  # module.infrastructure.module.kubernetes_cluster_infrastructure.digitalocean_database_user.language_service_user will be created
  + resource "digitalocean_database_user" "language_service_user" {
      + cluster_id = (known after apply)
      + id         = (known after apply)
      + name       = "language_service"
      + password   = (sensitive value)
      + role       = (known after apply)
    }

  # module.infrastructure.module.kubernetes_cluster_infrastructure.kubernetes_secret.language_service_cache_credentials will be created
  + resource "kubernetes_secret" "language_service_cache_credentials" {
      + data = (sensitive value)
      + id   = (known after apply)
      + type = "Opaque"

      + metadata {
          + generation       = (known after apply)
          + name             = "language-service-cache-credentials"
          + namespace        = "default"
          + resource_version = (known after apply)
          + self_link        = (known after apply)
          + uid              = (known after apply)
        }
    }

Plan: 5 to add, 0 to change, 0 to destroy.

Warning: Value for undeclared variable

The root module does not declare a variable named "api_secret_key_base" but a
value was found in file "/terraform/terraform.tfvars". To use this value, add
a "variable" block to the configuration.

Using a variables file to set an undeclared variable is deprecated and will
become an error in a future release. If you wish to provide certain "global"
settings to all configurations in your organization, use TF_VAR_...
environment variables to set these instead.

```

</details>

*Workflow: `Test infrastructure`, Action: `hashicorpterraform-github-actions4`, Working Directory: `.`, Workspace: `default`*
